<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","label":"prod","backend":"9e597c1899f0ebd9d334e8a6809031485891a28c79d0fa47acbbe456c9e42d7f","plan_job_ref":"Job Plan (PR) #6 at https://github.com/rogierv/my-infra/actions/runs/23729837387","plan_out_hash":"5a66edb7aaa7a3f9da42cd17cba6c5b78f384cfccd55e0f05c028468918ff8b0","plan_hash":"8a288b4f921f27f1d6dfb779179c7149ad59afbd05f03fc23766e62be596f2e8","plan_text_format":"diff","version":"2.2.3"} -->
Terraform plan for __prod__
<details>
<summary>Plan: 7 to add, 0 to change, 7 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_role_assignment.app_config_data_reader must be replaced
-/+ resource "azurerm_role_assignment" "app_config_data_reader" {
+       condition_version                      = (known after apply)
!~      id                                     = "**************************************************************************************************************************************************************************************************************************************************" -> (known after apply)
!~      name                                   = "aa2316b5-8b18-bf74-a6e7-a2c86097f6fc" -> (known after apply)
!~      principal_type                         = "Group" -> (known after apply)
!~      role_definition_id                     = "******************************************************************************************************************************************" -> (known after apply)
!~      scope                                  = "/subscriptions/6dd133d0-39f7-42b4-bb55-5e2c835e1d9a/resourceGroups/rv-infra-prod/providers/Microsoft.AppConfiguration/configurationStores/rv-appconfig-prod" -> (known after apply) # forces replacement
+       skip_service_principal_aad_check       = (known after apply)
#        (5 unchanged attributes hidden)
    }

  # azurerm_role_assignment.key_vault_secrets_officer must be replaced
-/+ resource "azurerm_role_assignment" "key_vault_secrets_officer" {
+       condition_version                      = (known after apply)
!~      id                                     = "**********************************************************************************************************************************************************************************************************************" -> (known after apply)
!~      name                                   = "1d479dd7-1dfe-4abb-463a-8200ca1ad39e" -> (known after apply)
!~      principal_type                         = "Group" -> (known after apply)
!~      role_definition_id                     = "******************************************************************************************************************************************" -> (known after apply)
!~      scope                                  = "/subscriptions/6dd133d0-39f7-42b4-bb55-5e2c835e1d9a/resourceGroups/rv-infra-prod/providers/Microsoft.KeyVault/vaults/rv-kv-prod" -> (known after apply) # forces replacement
+       skip_service_principal_aad_check       = (known after apply)
#        (5 unchanged attributes hidden)
    }

  # module.app_config.azurerm_app_configuration.this must be replaced
-/+ resource "azurerm_app_configuration" "this" {
!~      endpoint                                         = "https://rv-appconfig-prod.azconfig.io" -> (known after apply)
!~      id                                               = "***********************************************************************************************************************************************************" -> (known after apply)
        name                                             = "rv-appconfig-prod"
!~      primary_read_key                                 = [
-           {
-               connection_string = "Endpoint=https://rv-appconfig-prod.azconfig.io;Id=7sEo;Secret=7hQYNk5xhgbe04yrgmI0dlDXGosJxR2t2kYjntD3KLVVmkEhCDCXJQQJ99CCAC5RqLJKOFKzAAABAZAC1rTm"
-               id                = "7sEo"
-               secret            = "7hQYNk5xhgbe04yrgmI0dlDXGosJxR2t2kYjntD3KLVVmkEhCDCXJQQJ99CCAC5RqLJKOFKzAAABAZAC1rTm"
            },
        ] -> (known after apply)
!~      primary_write_key                                = [
-           {
-               connection_string = "Endpoint=https://rv-appconfig-prod.azconfig.io;Id=K3AT;Secret=E26n4GaCUBSK99wS4aZeFBb99GOfsyptu71vIqqwBVc13NtPRDw4JQQJ99CCAC5RqLJKOFKzAAACAZAC2GEB"
-               id                = "K3AT"
-               secret            = "E26n4GaCUBSK99wS4aZeFBb99GOfsyptu71vIqqwBVc13NtPRDw4JQQJ99CCAC5RqLJKOFKzAAACAZAC2GEB"
            },
        ] -> (known after apply)
!~      resource_group_name                              = "rv-infra-prod" -> "rv-rg-infra-prod" # forces replacement
!~      secondary_read_key                               = [
-           {
-               connection_string = "Endpoint=https://rv-appconfig-prod.azconfig.io;Id=2xN7;Secret=6UkDbdAwkWwTf0cNqKubFR2RqVQwAfPzCISlk80c34gcbStFN3MOJQQJ99CCAC5RqLJKOFKzAAABAZAC4Pmz"
-               id                = "2xN7"
-               secret            = "6UkDbdAwkWwTf0cNqKubFR2RqVQwAfPzCISlk80c34gcbStFN3MOJQQJ99CCAC5RqLJKOFKzAAABAZAC4Pmz"
            },
        ] -> (known after apply)
!~      secondary_write_key                              = [
-           {
-               connection_string = "Endpoint=https://rv-appconfig-prod.azconfig.io;Id=DgWQ;Secret=2y3Ky6hPh6ciotV8idJneWE1HA5qlAO6VVJrQJ8Wi3GZQkAbXFf4JQQJ99CCAC5RqLJKOFKzAAACAZAC1gMW"
-               id                = "DgWQ"
-               secret            = "2y3Ky6hPh6ciotV8idJneWE1HA5qlAO6VVJrQJ8Wi3GZQkAbXFf4JQQJ99CCAC5RqLJKOFKzAAACAZAC1gMW"
            },
        ] -> (known after apply)
!~      soft_delete_retention_days                       = 0 -> 7
-       tags                                             = {} -> null
#        (7 unchanged attributes hidden)
    }

  # module.app_insights.azurerm_application_insights.this must be replaced
-/+ resource "azurerm_application_insights" "this" {
!~      app_id                                = "************************************" -> (known after apply)
!~      connection_string                     = (sensitive value)
-       daily_data_cap_notifications_disabled = false -> null
!~      id                                    = "********************************************************************************************************************************************" -> (known after apply)
!~      instrumentation_key                   = (sensitive value)
        name                                  = "rv-appinsights-prod"
!~      resource_group_name                   = "rv-infra-prod" -> "rv-rg-infra-prod" # forces replacement
-       tags                                  = {} -> null
!~      workspace_id                          = "************************************************************************************************************************************************" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # module.app_insights.azurerm_log_analytics_workspace.this must be replaced
-/+ resource "azurerm_log_analytics_workspace" "this" {
-       cmk_for_query_forced                    = false -> null
!~      id                                      = "************************************************************************************************************************************************" -> (known after apply)
-       immediate_data_purge_on_30_days_enabled = false -> null
!~      local_authentication_disabled           = false -> (known after apply)
        name                                    = "rv-laws-prod"
!~      primary_shared_key                      = (sensitive value)
!~      resource_group_name                     = "rv-infra-prod" -> "rv-rg-infra-prod" # forces replacement
!~      retention_in_days                       = 30 -> (known after apply)
!~      secondary_shared_key                    = (sensitive value)
!~      sku                                     = "PerGB2018" -> (known after apply)
-       tags                                    = {} -> null
!~      workspace_id                            = "************************************" -> (known after apply)
#        (7 unchanged attributes hidden)
    }

  # module.key_vault.azurerm_key_vault.this must be replaced
-/+ resource "azurerm_key_vault" "this" {
!~      access_policy                   = [] -> (known after apply)
!~      enable_rbac_authorization       = true -> (known after apply)
-       enabled_for_deployment          = false -> null
-       enabled_for_disk_encryption     = false -> null
-       enabled_for_template_deployment = false -> null
!~      id                              = "*******************************************************************************************************************************" -> (known after apply)
        name                            = "rv-kv-prod"
!~      resource_group_name             = "rv-infra-prod" -> "rv-rg-infra-prod" # forces replacement
-       tags                            = {} -> null
!~      vault_uri                       = "https://rv-kv-prod.vault.azure.net/" -> (known after apply)
#        (7 unchanged attributes hidden)

!~      contact (known after apply)

!~      network_acls (known after apply)
-       network_acls {
-           bypass                     = "AzureServices" -> null
-           default_action             = "Allow" -> null
-           ip_rules                   = [] -> null
-           virtual_network_subnet_ids = [] -> null
        }
    }

  # module.resource_group.azurerm_resource_group.this must be replaced
-/+ resource "azurerm_resource_group" "this" {
!~      id         = "********************************************************************************" -> (known after apply)
!~      name       = "rv-infra-prod" -> "rv-rg-infra-prod" # forces replacement
-       tags       = {} -> null
#        (2 unchanged attributes hidden)
    }

Plan: 7 to add, 0 to change, 7 to destroy.
```
</details>

:memo: Plan generated in [Plan (PR) #6](https://github.com/rogierv/my-infra/actions/runs/23729837387)